## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 3 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                      NAME                                      |
|----------|--------------------------------------------------------------------------------|
| update   | `aws_cloudwatch_metric_alarm.scan-files-document-download-bucket-size-warning` |
|          | `module.s3_scan_objects.aws_iam_policy.scan_files[0]`                          |
|          | `module.s3_scan_objects.aws_sqs_queue_policy.s3_scan_object`                   |
| recreate | `aws_s3_bucket.scan_files_document_bucket`                                     |
|          | `aws_s3_bucket_public_access_block.scan_files_document_bucket`                 |
|          | `module.s3_scan_objects.aws_s3_bucket_notification.s3_scan_object`             |
|          | `module.s3_scan_objects.aws_s3_bucket_policy.upload_bucket[0]`                 |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/5414350062).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.scan-files-document-download-bucket-size-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "scan-files-document-download-bucket-size-warning" {
      ~ dimensions                = {
          ~ "BucketName"  = "notification-canada-ca-staging-document-download-scan-files" -> "notification-canada-ca-staging-dd-scan-files"
            # (1 unchanged element hidden)
        }
        id                        = "scan-files-document-download-bucket-size-warning"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_s3_bucket.scan_files_document_bucket must be replaced
-/+ resource "aws_s3_bucket" "scan_files_document_bucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files" -> (known after apply)
      ~ bucket                      = "notification-canada-ca-staging-document-download-scan-files" -> "notification-canada-ca-staging-dd-scan-files" # forces replacement
      ~ bucket_domain_name          = "notification-canada-ca-staging-document-download-scan-files.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "notification-canada-ca-staging-document-download-scan-files.s3.ca-central-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1QDHH18159H29" -> (known after apply)
      ~ id                          = "notification-canada-ca-staging-document-download-scan-files" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                          - "s3:DeleteObjectVersionTagging",
                          - "s3:DeleteObjectTagging",
                        ]
                      - Condition = {
                          - StringNotLike = {
                              - aws:PrincipalArn = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetObjectVersionTagging",
                          - "s3:GetObjectVersion",
                          - "s3:GetObjectTagging",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
                        ]
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "ca-central-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "69e55cefe4e71d4930761796ca1b0184cad872eb794dd25fbfc366b4501a75f9" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      ~ lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
            id                                     = "tf-s3-lifecycle-all-files"
          - tags                                   = {} -> null
            # (1 unchanged attribute hidden)

          ~ expiration {
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ logging {
            # (1 unchanged attribute hidden)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              - bucket_key_enabled = false -> null

              ~ apply_server_side_encryption_by_default {
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.scan_files_document_bucket must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "scan_files_document_bucket" {
      ~ bucket                  = "notification-canada-ca-staging-document-download-scan-files" -> (known after apply) # forces replacement
      ~ id                      = "notification-canada-ca-staging-document-download-scan-files" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.limit_tagging[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "limit_tagging"  {
      ~ id      = "1464041064" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                          - "s3:DeleteObjectVersionTagging",
                          - "s3:DeleteObjectTagging",
                        ]
                      - Condition = {
                          - StringNotLike = {
                              - aws:PrincipalArn = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.s3_scan_object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_scan_object"  {
      ~ id      = "2194749677" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - aws:SourceArn = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "s3.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:ca-central-1:239043911459:s3-scan-object"
                      - Sid       = "S3sendToSQS"
                    },
                  - {
                      - Action    = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::806545929748:role/s3-scan-object"
                        }
                      - Resource  = "arn:aws:sqs:ca-central-1:239043911459:s3-scan-object"
                      - Sid       = "LambdaTriggerFromSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)

          - condition {
              - test     = "ArnEquals" -> null
              - values   = [
                  - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
                ] -> null
              - variable = "aws:SourceArn" -> null
            }
          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

            # (1 unchanged block hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.scan_files[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_files"  {
      ~ id      = "2100094203" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                          - "s3:ListBucket",
                          - "s3:GetObjectVersionTagging",
                          - "s3:GetObjectVersion",
                          - "s3:GetObjectTagging",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObjectVersionTagging",
                          - "s3:DeleteObjectTagging",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
              - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
              ~ (known after apply),
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.scan_files_download[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_files_download"  {
      ~ id      = "1717415996" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetObjectVersionTagging",
                          - "s3:GetObjectVersion",
                          - "s3:GetObjectTagging",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
                        ]
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
              - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
              ~ (known after apply),
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.s3_scan_objects.data.aws_iam_policy_document.upload_bucket[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "upload_bucket"  {
      ~ id                      = "219460136" -> (known after apply)
      ~ json                    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                          - "s3:DeleteObjectVersionTagging",
                          - "s3:DeleteObjectTagging",
                        ]
                      - Condition = {
                          - StringNotLike = {
                              - aws:PrincipalArn = [
                                  - "arn:aws:iam::239043911459:role/ScanFilesGetObjects",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetObjectVersionTagging",
                          - "s3:GetObjectVersion",
                          - "s3:GetObjectTagging",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
                        ]
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ source_policy_documents = [
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = [
                              - "s3:PutObjectVersionTagging",
                              - "s3:PutObjectTagging",
                              - "s3:DeleteObjectVersionTagging",
                              - "s3:DeleteObjectTagging",
                            ]
                          - Condition = {
                              - StringNotLike = {
                                  - aws:PrincipalArn = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                                }
                            }
                          - Effect    = "Deny"
                          - Principal = {
                              - AWS = "*"
                            }
                          - Resource  = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*"
                          - Sid       = ""
                        },
                      - {
                          - Action    = [
                              - "s3:PutObjectVersionTagging",
                              - "s3:PutObjectTagging",
                            ]
                          - Effect    = "Allow"
                          - Principal = {
                              - AWS = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                            }
                          - Resource  = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*"
                          - Sid       = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = [
                              - "s3:ListBucket",
                              - "s3:GetObjectVersionTagging",
                              - "s3:GetObjectVersion",
                              - "s3:GetObjectTagging",
                              - "s3:GetObject",
                              - "s3:GetBucketLocation",
                            ]
                          - Effect    = "Allow"
                          - Principal = {
                              - AWS = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                            }
                          - Resource  = [
                              - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
                              - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
                            ]
                          - Sid       = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + (known after apply),
        ]
      - version                 = "2012-10-17" -> null
    }

  # module.s3_scan_objects.aws_iam_policy.scan_files[0] will be updated in-place
  ~ resource "aws_iam_policy" "scan_files" {
        id        = "arn:aws:iam::239043911459:policy/ScanFilesGetObjects"
        name      = "ScanFilesGetObjects"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                          - "s3:ListBucket",
                          - "s3:GetObjectVersionTagging",
                          - "s3:GetObjectVersion",
                          - "s3:GetObjectTagging",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObjectVersionTagging",
                          - "s3:DeleteObjectTagging",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.s3_scan_objects.aws_s3_bucket_notification.s3_scan_object must be replaced
-/+ resource "aws_s3_bucket_notification" "s3_scan_object" {
      ~ bucket      = "notification-canada-ca-staging-document-download-scan-files" -> (known after apply) # forces replacement
      ~ id          = "notification-canada-ca-staging-document-download-scan-files" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ queue {
            id        = "ScanObjectCreated"
            # (2 unchanged attributes hidden)
        }
    }

  # module.s3_scan_objects.aws_s3_bucket_policy.upload_bucket[0] must be replaced
-/+ resource "aws_s3_bucket_policy" "upload_bucket" {
      ~ bucket = "notification-canada-ca-staging-document-download-scan-files" -> (known after apply) # forces replacement
      ~ id     = "notification-canada-ca-staging-document-download-scan-files" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                          - "s3:DeleteObjectVersionTagging",
                          - "s3:DeleteObjectTagging",
                        ]
                      - Condition = {
                          - StringNotLike = {
                              - aws:PrincipalArn = [
                                  - "arn:aws:iam::239043911459:role/ScanFilesGetObjects",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectTagging",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "s3:ListBucket",
                          - "s3:GetObjectVersionTagging",
                          - "s3:GetObjectVersion",
                          - "s3:GetObjectTagging",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::239043911459:role/ScanFilesGetObjects"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files/*",
                          - "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
                        ]
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.s3_scan_objects.aws_sqs_queue_policy.s3_scan_object will be updated in-place
  ~ resource "aws_sqs_queue_policy" "s3_scan_object" {
        id        = "https://sqs.ca-central-1.amazonaws.com/239043911459/s3-scan-object"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - aws:SourceArn = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files"
                      ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
